tap "homebrew/bundle"
tap "hashicorp/tap" # To install Hashicorp apps

brew 'mas' # Command line tools for app store https://github.com/mas-cli/mas

# Communication Tools
 mas 'Slack', id: 803453959 # will fail on first install, apps must be 'purchased' manually first

# Window manager
 mas "Magnet", id: 441258766

# Source control
brew 'git'
cask "github" # Github Desktop client

# Browsers
cask 'google-chrome'

# Terminal
cask 'iterm2' # Terminal emulator

# Docker
cask 'docker'

# Dev tools
cask "visual-studio-code" # VS Code 
brew "shellcheck" # static code analysis for shell scripts 
vscode "timonwong.shellcheck" # shellcheck vscode plugin
brew "hashicorp/tap/terraform" # Terraform

# Languages
## Python
### use pyenv to install Python with the below commands
### pyenv install 3.11
### pyenv global 3.11
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
### python dependencies
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "tcl-tk"
brew "zlib"

# AI Tools
brew "ollama"

#Databases
brew "duckdb"
cask "snowflake-snowsql"

# Cloud
## Google Cloud SDK
cask "google-cloud-sdk"

# Terminal tools
brew "zoxide"


# VSCode
vscode "hashicorp.terraform"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"