tap "homebrew/bundle"
tap "hashicorp/tap" # To install Hashicorp apps

brew 'mas' # Command line tools for app store https://github.com/mas-cli/mas

# Company Tools
# mas 'Slack', id: 803453959 # will fail on first install, apps must be 'purchased' manually first

# Source control
brew 'git'

# Browsers
cask 'google-chrome'

# Terminal
cask 'iterm2' # Terminal emulator

# Docker
cask 'docker'

# Dev tools
cask "visual-studio-code" # VS Code 
cask "github" # Github Desktop client
brew "shellcheck" # static code analysis for shell scripts 
vscode "timonwong.shellcheck" # shellcheck vscode plugin
brew "hashicorp/tap/terraform" # Terraform

# Languages
## Python
### use pyenv to install Python with the below commands
### pyenv install 3.11
### pyenv global 3.11
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
### python dependencies
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "tcl-tk"
brew "zlib"

# Cloud
## Google Cloud SDK
cask "google-cloud-sdk"
